OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/pitz/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1e-6;

writeControl    runTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.75;

maxDeltaT       1;

functions
{
	#includeFunc scalarTransport

	/*wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (cylinder);
    }*/
	
	gradP
	{
		type			grad;
		libs			(fieldFunctionObjects);
		field 			p;
		writeControl	writeTime;
	}
	
	gradU
	{
		type			grad;
		libs			(fieldFunctionObjects);
		field 			U;
		writeControl	writeTime;
	}
}
// ************************************************************************* //
